app/controllers/england_news_controller.rb

SELECT "england_news".* FROM "england_news"
SELECT  "england_news".* FROM "england_news" WHERE (england_news.fystart LIKE '2015%') LIMIT ? OFFSET ?  [["LIMIT", 1000], ["OFFSET", 0]]
SELECT COUNT(*) FROM "england_news" WHERE (england_news.fystart LIKE '2015%')
---
  def index
    #Finds the all English charities
    @england_news = EnglandNew.all

    #Return all filtered results
    @filterrific = initialize_filterrific(EnglandNew, params[:filterrific]) or return
    @filtered = @filterrific.find.page(params[:england_news])

SELECT  "england_news".* FROM "england_news" WHERE "england_news"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  "england_news".* FROM "england_news" WHERE "england_news"."regno" = ? ORDER BY "england_news"."id" ASC LIMIT ?  [["regno", 200002], ["LIMIT", 1000]]
---
  def show
    #Finds the charity that has been clicked on
    @england_new= EnglandNew.find(params[:id])
    #Puts the charity address in the format gmaps can work with
    @extract_address = @england_new.add1 + ", " + @england_new.postcode
    #Finds all of the financial data records for a given charity
    @extract_income = EnglandNew.where(regno: @england_new.regno).find_each

SELECT "england_news".* FROM "england_news" WHERE "england_news"."id" IN (27, 41, 13)
SELECT  "england_news".* FROM "england_news" WHERE (regno = 200009 AND fystart LIKE '2015%') ORDER BY "england_news"."id" ASC LIMIT ?  [["LIMIT", 1000]]
---
  def comparison
    #Finds all details of charities selected for comparison
    @compare = EnglandNew.find(session[:engids])
    address=[]
    financials = []
    expend=[]
    income = []
    #Finds addresses of all charities selected for comparison
    @compare.each do |a|
      address.push(a.add1 + ", " + a.postcode)
    end
    #Finds financial information from 2015 for all charities selected for comparison
    @compare.each do |a|
      financials.push(EnglandNew.where('regno = ? AND fystart LIKE ?', a.regno, '2015%').find_each)