app/controllers/northern_irelands_controller.rb

  def index
    #Find all charities in NI
    @northern_irelands = NorthernIreland.all
    #Filter charities in NI
    @filterrific = initialize_filterrific(NorthernIreland, params[:filterrific]) or return
     @filtered = @filterrific.find.page(params[:northern_irelands])
---
SELECT  "northern_irelands".* FROM "northern_irelands" WHERE (northern_irelands.charity_name ILIKE '%action%') LIMIT ? OFFSET ?  [["LIMIT", 1000], ["OFFSET", 0]]
SELECT COUNT(*) FROM "northern_irelands"