app/controllers/scotlands_controller.rb

  def index
    #Find all charities in Scotland
    @scotlands = Scotland.all
    #Filter all charities in Scotland
    @filterrific = initialize_filterrific(Scotland, params[:filterrific]) or return
    @filtered = @filterrific.find.page(params[:scotlands])
---
SELECT "scotlands".* FROM "scotlands" WHERE (scotlands.most_recent_year_income > '100000' AND scotlands.most_recent_year_income <'500000')
SELECT  "scotlands".* FROM "scotlands" WHERE (scotlands.most_recent_year_income > '100000' AND scotlands.most_recent_year_income <'500000') LIMIT ? OFFSET ?  [["LIMIT", 1000], ["OFFSET", 0]]
SELECT COUNT(*) FROM "scotlands" WHERE (scotlands.most_recent_year_income > '100000' AND scotlands.most_recent_year_income <'500000')